{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_1", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "image_input"}, "name": "image_input", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name": "efficientnetb0", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Rescaling", "config": {"name": "rescaling_2", "trainable": true, "dtype": "float32", "scale": 0.00392156862745098, "offset": 0.0}, "name": "rescaling_2", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_1", "trainable": true, "dtype": "float32", "axis": [3], "invert": false, "mean": null, "variance": null}, "name": "normalization_1", "inbound_nodes": [[["rescaling_2", 0, 0, {}]]]}, {"class_name": "Rescaling", "config": {"name": "rescaling_3", "trainable": true, "dtype": "float32", "scale": [2.0896918976428642, 2.1128856368212916, 2.1081851067789197], "offset": 0.0}, "name": "rescaling_3", "inbound_nodes": [[["normalization_1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stem_conv_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "stem_conv_pad", "inbound_nodes": [[["rescaling_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stem_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stem_conv", "inbound_nodes": [[["stem_conv_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stem_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stem_bn", "inbound_nodes": [[["stem_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stem_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "stem_activation", "inbound_nodes": [[["stem_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block1a_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block1a_dwconv", "inbound_nodes": [[["stem_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1a_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1a_bn", "inbound_nodes": [[["block1a_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block1a_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block1a_activation", "inbound_nodes": [[["block1a_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block1a_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block1a_se_squeeze", "inbound_nodes": [[["block1a_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block1a_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 32]}, "name": "block1a_se_reshape", "inbound_nodes": [[["block1a_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1a_se_reduce", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1a_se_reduce", "inbound_nodes": [[["block1a_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1a_se_expand", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1a_se_expand", "inbound_nodes": [[["block1a_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block1a_se_excite", "trainable": true, "dtype": "float32"}, "name": "block1a_se_excite", "inbound_nodes": [[["block1a_activation", 0, 0, {}], ["block1a_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1a_project_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1a_project_conv", "inbound_nodes": [[["block1a_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1a_project_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1a_project_bn", "inbound_nodes": [[["block1a_project_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_expand_conv", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_expand_conv", "inbound_nodes": [[["block1a_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_expand_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2a_expand_bn", "inbound_nodes": [[["block2a_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2a_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2a_expand_activation", "inbound_nodes": [[["block2a_expand_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "block2a_dwconv_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "block2a_dwconv_pad", "inbound_nodes": [[["block2a_expand_activation", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block2a_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block2a_dwconv", "inbound_nodes": [[["block2a_dwconv_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2a_bn", "inbound_nodes": [[["block2a_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2a_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2a_activation", "inbound_nodes": [[["block2a_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block2a_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block2a_se_squeeze", "inbound_nodes": [[["block2a_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block2a_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 96]}, "name": "block2a_se_reshape", "inbound_nodes": [[["block2a_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_se_reduce", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_se_reduce", "inbound_nodes": [[["block2a_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_se_expand", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_se_expand", "inbound_nodes": [[["block2a_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block2a_se_excite", "trainable": true, "dtype": "float32"}, "name": "block2a_se_excite", "inbound_nodes": [[["block2a_activation", 0, 0, {}], ["block2a_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_project_conv", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_project_conv", "inbound_nodes": [[["block2a_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_project_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2a_project_bn", "inbound_nodes": [[["block2a_project_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_expand_conv", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_expand_conv", "inbound_nodes": [[["block2a_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_expand_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2b_expand_bn", "inbound_nodes": [[["block2b_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2b_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2b_expand_activation", "inbound_nodes": [[["block2b_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block2b_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block2b_dwconv", "inbound_nodes": [[["block2b_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2b_bn", "inbound_nodes": [[["block2b_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2b_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2b_activation", "inbound_nodes": [[["block2b_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block2b_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block2b_se_squeeze", "inbound_nodes": [[["block2b_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block2b_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 144]}, "name": "block2b_se_reshape", "inbound_nodes": [[["block2b_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_se_reduce", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_se_reduce", "inbound_nodes": [[["block2b_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_se_expand", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_se_expand", "inbound_nodes": [[["block2b_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block2b_se_excite", "trainable": true, "dtype": "float32"}, "name": "block2b_se_excite", "inbound_nodes": [[["block2b_activation", 0, 0, {}], ["block2b_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_project_conv", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_project_conv", "inbound_nodes": [[["block2b_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_project_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2b_project_bn", "inbound_nodes": [[["block2b_project_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "block2b_drop", "trainable": true, "dtype": "float32", "rate": 0.025, "noise_shape": [null, 1, 1, 1], "seed": null}, "name": "block2b_drop", "inbound_nodes": [[["block2b_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block2b_add", "trainable": true, "dtype": "float32"}, "name": "block2b_add", "inbound_nodes": [[["block2b_drop", 0, 0, {}], ["block2a_project_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3a_expand_conv", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3a_expand_conv", "inbound_nodes": [[["block2b_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3a_expand_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3a_expand_bn", "inbound_nodes": [[["block3a_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3a_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block3a_expand_activation", "inbound_nodes": [[["block3a_expand_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "block3a_dwconv_pad", "trainable": true, "dtype": "float32", "padding": [[1, 2], [1, 2]], "data_format": "channels_last"}, "name": "block3a_dwconv_pad", "inbound_nodes": [[["block3a_expand_activation", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block3a_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block3a_dwconv", "inbound_nodes": [[["block3a_dwconv_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3a_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3a_bn", "inbound_nodes": [[["block3a_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3a_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block3a_activation", "inbound_nodes": [[["block3a_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block3a_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block3a_se_squeeze", "inbound_nodes": [[["block3a_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block3a_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 144]}, "name": "block3a_se_reshape", "inbound_nodes": [[["block3a_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3a_se_reduce", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3a_se_reduce", "inbound_nodes": [[["block3a_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3a_se_expand", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3a_se_expand", "inbound_nodes": [[["block3a_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block3a_se_excite", "trainable": true, "dtype": "float32"}, "name": "block3a_se_excite", "inbound_nodes": [[["block3a_activation", 0, 0, {}], ["block3a_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3a_project_conv", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3a_project_conv", "inbound_nodes": [[["block3a_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3a_project_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3a_project_bn", "inbound_nodes": [[["block3a_project_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3b_expand_conv", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3b_expand_conv", "inbound_nodes": [[["block3a_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3b_expand_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3b_expand_bn", "inbound_nodes": [[["block3b_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3b_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block3b_expand_activation", "inbound_nodes": [[["block3b_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block3b_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block3b_dwconv", "inbound_nodes": [[["block3b_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3b_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3b_bn", "inbound_nodes": [[["block3b_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3b_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block3b_activation", "inbound_nodes": [[["block3b_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block3b_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block3b_se_squeeze", "inbound_nodes": [[["block3b_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block3b_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 240]}, "name": "block3b_se_reshape", "inbound_nodes": [[["block3b_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3b_se_reduce", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3b_se_reduce", "inbound_nodes": [[["block3b_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3b_se_expand", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3b_se_expand", "inbound_nodes": [[["block3b_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block3b_se_excite", "trainable": true, "dtype": "float32"}, "name": "block3b_se_excite", "inbound_nodes": [[["block3b_activation", 0, 0, {}], ["block3b_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3b_project_conv", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3b_project_conv", "inbound_nodes": [[["block3b_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3b_project_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3b_project_bn", "inbound_nodes": [[["block3b_project_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "block3b_drop", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": [null, 1, 1, 1], "seed": null}, "name": "block3b_drop", "inbound_nodes": [[["block3b_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block3b_add", "trainable": true, "dtype": "float32"}, "name": "block3b_add", "inbound_nodes": [[["block3b_drop", 0, 0, {}], ["block3a_project_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4a_expand_conv", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4a_expand_conv", "inbound_nodes": [[["block3b_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4a_expand_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4a_expand_bn", "inbound_nodes": [[["block4a_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block4a_expand_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block4a_expand_activation", "inbound_nodes": [[["block4a_expand_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "block4a_dwconv_pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "block4a_dwconv_pad", "inbound_nodes": [[["block4a_expand_activation", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block4a_dwconv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block4a_dwconv", "inbound_nodes": [[["block4a_dwconv_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4a_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4a_bn", "inbound_nodes": [[["block4a_dwconv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block4a_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block4a_activation", "inbound_nodes": [[["block4a_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block4a_se_squeeze", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block4a_se_squeeze", "inbound_nodes": [[["block4a_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block4a_se_reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 240]}, "name": "block4a_se_reshape", "inbound_nodes": [[["block4a_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4a_se_reduce", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4a_se_reduce", "inbound_nodes": [[["block4a_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4a_se_expand", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4a_se_expand", "inbound_nodes": [[["block4a_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block4a_se_excite", "trainable": true, "dtype": "float32"}, "name": "block4a_se_excite", "inbound_nodes": [[["block4a_activation", 0, 0, {}], ["block4a_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4a_project_conv", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": 